@c -----------------------------------------------------------------------------
@c File     : f90.de.texi
@c License  : GNU General Public License (GPL)
@c Language : German
@c Original : f90.texi revision 21.08.2011
@c Date     : 08.11.2010
@c Revision : 21.08.2011
@c 
@c This file is part of Maxima -- GPL CAS based on DOE-MACSYMA
@c -----------------------------------------------------------------------------

@menu
* Functions and Variables for f90::
@end menu

@c -----------------------------------------------------------------------------
@node Functions and Variables for f90,  , f90, f90
@section Functions and Variables for f90
@c -----------------------------------------------------------------------------

@c -----------------------------------------------------------------------------
@anchor{function_f90}
@deffn {Function} f90 (@var{expr_1}, @dots{}, @var{expr_n})

Prints one or more expressions @var{expr_1}, @dots{}, @var{expr_n}
as a Fortran 90 program.
Output is printed to the standard output.

@code{f90} prints output in the so-called "free form" input format for 
Fortran 90:
there is no special attention to column positions.
Long lines are split at a fixed width with the ampersand @code{&} continuation 
character.

@code{load(f90)} loads this function.  See also the function @mrefdot{fortran}

Examples:

@example
(%i1) load (f90)$
(%i2) foo : expand ((xxx + yyy + 7)^4);
         4            3         3        2    2             2
(%o2) yyy  + 4 xxx yyy  + 28 yyy  + 6 xxx  yyy  + 84 xxx yyy
          2        3             2
 + 294 yyy  + 4 xxx  yyy + 84 xxx  yyy + 588 xxx yyy + 1372 yyy
      4         3          2
 + xxx  + 28 xxx  + 294 xxx  + 1372 xxx + 2401
(%i3) f90 ('foo = foo);
foo = yyy**4+4*xxx*yyy**3+28*yyy**3+6*xxx**2*yyy**2+84*xxx*yyy**2&
+294*yyy**2+4*xxx**3*yyy+84*xxx**2*yyy+588*xxx*yyy+1372*yyy+xxx**&
4+28*xxx**3+294*xxx**2+1372*xxx+2401
(%o3)                         false
@end example

Multiple expressions.
Capture standard output into a file via the @mref{with_stdout} function.

@example
(%i1) load (f90)$
(%i2) foo : sin (3*x + 1) - cos (7*x - 2);
(%o2)              sin(3 x + 1) - cos(7 x - 2)
(%i3) with_stdout ("foo.f90", 
                   f90 (x=0.25, y=0.625, 'foo=foo, 'stop, 'end));
(%o3)                         false
(%i4) printfile ("foo.f90");
x = 0.25
y = 0.625
foo = sin(3*x+1)-cos(7*x-2)
stop
end
(%o4)                        foo.f90
@end example
@end deffn

@c --- End of file f90.de.texi -------------------------------------------------

